In [ ]:
import pandas as pd
import numpy as np

## Задание 0

Для всех  заданий будем использовать обезличенные транзакционные банковские данные. Для этого считайте в переменные **tr_mcc_codes, tr_types, transactions и gender_train** из одноимённых таблиц из папки data. Для таблицы transactions используйте только первые n=1000000 строк. Обратите внимание на разделители внутри каждого из файлов - они могут различаться!

###  Описание данных
#### Таблица ```transactions.csv```
##### Описание
Таблица содержит историю транзакций клиентов банка за один год и три месяца.

##### Формат данных

```
customer_id,tr_datetime,mcc_code,tr_type,amount,term_id
111111,15 01:40:52,1111,1000,-5224,111111
111112,15 15:18:32,3333,2000,-100,11122233
...
```
##### Описание полей

 - ```customer_id``` — идентификатор клиента;
 - ```tr_datetime``` — день и время совершения транзакции (дни нумеруются с начала данных);
 - ```mcc_code``` — mcc-код транзакции;
 - ```tr_type``` — тип транзакции;
 - ```amount``` — сумма транзакции в условных единицах со знаком; ```+``` — начисление средств клиенту (приходная транзакция), ```-``` — списание средств (расходная транзакция);
 - ```term_id``` — идентификатор терминала;


#### Таблица ```gender_train.csv```

##### Описание
Данная таблица содержит информацию по полу для части клиентов, для которых он известен. Для остальных клиентов пол неизвестен.

##### Формат данных
```
customer_id,gender
111111,0
111112,1
...
```

##### Описание полей
 - ```customer_id``` — идентификатор клиента;
 - ```gender``` — пол клиента;

### Таблица ```tr_mcc_codes.csv```

##### Описание
Данная таблица содержит описание mcc-кодов транзакций.

##### Формат данных
```
mcc_code;mcc_description
1000;словесное описание mcc-кода 1000
2000;словесное описание mcc-кода 2000
...
```

##### Описание полей
 - ```mcc_code``` – mcc-код транзакции;
 - ```mcc_description``` — описание mcc-кода транзакции.

#### Таблица ```tr_types.csv```

##### Описание
Данная таблица содержит описание типов транзакций.

##### Формат данных
```
tr_type;tr_description
1000;словесное описание типа транзакции 1000
2000;словесное описание типа транзакции 2000
...
```

##### Описание полей
 - ```tr_type``` – тип транзакции;
 - ```tr_description``` — описание типа транзакции;

## Задание 1

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
transactions = pd.read_csv(filepath_or_buffer = "data/transactions.csv",
            sep = ',',
            nrows = 1000000)
transactions

        customer_id   tr_datetime  mcc_code  tr_type    amount   term_id
0          39026145    0 10:23:26      4814     1030  -2245.92       NaN
1          39026145    1 10:19:29      6011     7010  56147.89       NaN
2          39026145    1 10:20:56      4829     2330 -56147.89       NaN
3          39026145    1 10:39:54      5499     1010  -1392.47       NaN
4          39026145    2 15:33:42      5499     1010   -920.83       NaN
...             ...           ...       ...      ...       ...       ...
999995     98801178  269 10:29:06      5921     1010 -23016.59    127873
999996     98801178  270 10:26:45      5211     1010 -61380.88  10114209
999997     98801178  270 15:18:53      5921     1010 -11800.27  10105341
999998     98801178  271 12:47:13      5211     1010 -16170.59  10114209
999999     98801178  271 14:51:56      5921     1010 -10025.77    123991

[1000000 rows x 6 columns]

In [ ]:
tr_mcc_codes = pd.read_csv(filepath_or_buffer = "data/tr_mcc_codes.csv",
            sep = ';')
tr_mcc_codes

     mcc_code                                    mcc_description
0         742                                Ветеринарные услуги
1        1711  Генеральные подрядчики по вентиляции, теплосна...
2        1731                        Подрядчики по электричеству
3        1799  Подрядчики, специализированная торговля — нигд...
4        2741           Разнообразные издательства/печатное дело
..        ...                                                ...
179      9211  Судовые выплаты, включая алименты и детскую по...
180      9222                                             Штрафы
181      9311                                  Налоговые платежи
182      9399  Правительственные услуги, нигде ранее не класс...
183      9402             Почтовые услуги — только правительство

[184 rows x 2 columns]

In [ ]:
tr_types = pd.read_csv(filepath_or_buffer = "data/tr_types.csv",
            sep = ';')
tr_types

     tr_type                                     tr_description
0       3200  Плата за предоставление услуг посредством моби...
1       3210  Плата за предоставление отчета по счету карты ...
2       3800  Плата за обслуживание банковской карты (за пер...
3       4000            Плата за получение наличных в Сбербанке
4       4001  Плата за получение наличных в Сбербанке (в дру...
..       ...                                                ...
150     2990                             Списание по требованию
151     2992  Списание средств для погашения задолженности п...
152     3001            Комиссия за обслуживание ссудного счета
153     3030  Плата за обслуживание банковской карты (за пос...
154     3120                Плата за досрочный перевыпуск карты

[155 rows x 2 columns]

In [ ]:
gender_train = pd.read_csv(filepath_or_buffer = "data/gender_train.csv",
            sep = ',')
gender_train

      customer_id  gender
0        10928546       1
1        69348468       1
2        61009479       0
3        74045822       0
4        27979606       1
...           ...     ...
8395     90417572       0
8396     66837341       0
8397     10758984       1
8398     11376556       0
8399     29190649       0

[8400 rows x 2 columns]

1. Для столбца tr_type датафрейма transactions выберите произвольные 1000 строк с помощью метода sample
2. В полученной на предыдущем этапе подвыборке найдите долю транзакций (стобец tr_description в датасете tr_types), в которой содержится подстрока 'POS' или 'ATM'

In [ ]:
# Создаем сэмпл
tr_type_sample = transactions["tr_type"].sample(n=1000)
# Делаем маску
mask = (tr_types["tr_description"].str.contains("АТМ")) | (tr_types["tr_description"].str.contains("POS"))
# Применяем маску и находим подходящие типы
matching_types = tr_types[mask]["tr_type"]
# Находим типы в выборке, совпадающие с типами, найденными на прошлом этапе, 
# считаем сколько раз встречается True, сколько False
result = tr_type_sample.isin(matching_types).value_counts()
# Считаем отношение
result[True] / (result[True] + result[False])

0.633

## Задание 2


1. Для столбца tr_type датафрейма transactions посчитайте частоту встречаемости всех типов транзакций tr_type в transactions.
2. Выведите топ-10 транзакций по частоте встречаемости.

In [ ]:
# Считаем сколько раз встречается каждый тип, сортируем, выводим первые 10
top = transactions["tr_type"].value_counts().sort_values(ascending=False).head(10)
top

1010    231117
2010    151166
7070    149006
1110    137658
1030    118975
2370     49830
7010     28972
7030     26078
7071     15781
1100     15476
Name: tr_type, dtype: int64

## Задание 3
1. В датафрейме transactions найдите клиента с максимальной суммой приходов на карту
2. В датафрейме transactions найдите клиента с максимальной суммой расходов по карте
3. Найдите разницу для этих клиентов между суммой расходов и суммой приходов

In [ ]:
ids = transactions["customer_id"]
amounts = transactions["amount"]

income = pd.Series(data=[], dtype=float)
outcome = pd.Series(data=[], dtype=float)

# Итерируемся по айдишникам, разделяем транзакции на положительные и
# отрицательные. В любом из случаев смотрим наличия id в нужной серии, 
# если id имеется - суммриуем, нет - присваиваем
for index, value in ids.items():
  if amounts[index] > 0:
    if value in income:
      income[value] += amounts[index]
    else:
      income[value] = amounts[index]
  else:
    if value in outcome:
      outcome[value] += amounts[index]
    else:
      outcome[value] = amounts[index]

maxIncomeClient = income.sort_values(ascending=False).head(1)
maxOutcomeClient = outcome.sort_values(ascending=True).head(1)

print("Max income client: ", maxIncomeClient)
print("Max outcome client: ", maxOutcomeClient)

maxIncomeClient.iloc[0] + maxOutcomeClient.iloc[0]

Max income client:  70780820    1.248115e+09
dtype: float64
Max outcome client:  70780820   -1.249952e+09
dtype: float64

-1837317.979973793

## Задание 4
1. Найдите среднее арифметическое и медиану по всем типам транзакций из топ 10 из задания 2
1. Найдите среднее арифметическое и медиану по всем типам транзакций для клиентов из задания 3

In [ ]:
# 1
for index, value in top.items():
  matchingSeries = transactions[transactions.tr_type == index]["amount"]
  print("Median: ", matchingSeries.median())
  print("Average: ", matchingSeries.sum() / matchingSeries.count())

Median:  -7411.52
Average:  -19784.748639650046
Median:  -44918.32
Average:  -136077.62932504667
Median:  11319.42
Average:  65569.83170020001
Median:  -11207.57
Average:  -32119.330370773943
Median:  -2245.92
Average:  -5320.980221811305
Median:  -44918.32
Average:  -205418.24903170782
Median:  112295.79
Average:  276391.7895961618
Median:  13951.52
Average:  86104.33290896541
Median:  3593.47
Average:  66806.82662252075
Median:  -10188.259999999998
Average:  -44061.8272615663

In [ ]:
# 2
for index, value in maxIncomeClient.items():
  matchingSeries = transactions[transactions.customer_id == index]["amount"]
  print("Median: ", matchingSeries.median())
  print("Average: ", matchingSeries.sum() / matchingSeries.count())

Median:  8803.99
Average:  -20.694945765423416

## Подготовка для заданий 5-8

*Из заданий 5-8 нужно выполнить минимум два любых*

Соедините transactions с всеми остальными таблицами (tr_mcc_codes, tr_types, gender_train). Причём с gender_train необходимо смёрджиться с помощью left join, а с оставшимися датафреймами - через inner.
После получения результата таблицы gender_train, tr_types, tr_mcc_codes можно удалить. В результате соединения датафреймов должно получиться 999584 строки.

In [ ]:
transactions = pd.merge(transactions, gender_train, how='left')
transactions = pd.merge(transactions, tr_mcc_codes, how='inner')
transactions = pd.merge(transactions, tr_types, how='inner')
transactions.shape

(999584, 9)

In [ ]:
transactions.head()

   customer_id  ...                  tr_description
0     39026145  ...  Оплата услуги. Банкоматы СБ РФ
1     39026145  ...  Оплата услуги. Банкоматы СБ РФ
2     39026145  ...  Оплата услуги. Банкоматы СБ РФ
3     39026145  ...  Оплата услуги. Банкоматы СБ РФ
4     39026145  ...  Оплата услуги. Банкоматы СБ РФ

[5 rows x 9 columns]

## Задание 5

1. Определите модуль разницы между средними тратами женщин и мужчин (трата - отрицательное значение amount).
2. Определите модуль разницы между средними поступлениями у мужчин и женщин

Обратите внимание, что для вычисления модуля разности точных знаний о том, 
какой класc относится к мужчинам, а какой - к женщинам, не требуется.

In [ ]:
# 1

womenOutcome = transactions[(transactions.gender == 1) & (transactions.amount < 0)].amount
avgSpendingWomen = womenOutcome.sum() / womenOutcome.size

menOutcome = transactions[(transactions.gender == 0) & (transactions.amount < 0)].amount
avgSpendingMen = menOutcome.sum() / menOutcome.size

# 2

womenIncome = transactions[(transactions.gender == 1) & (transactions.amount > 0)].amount
avgIncomeWomen = womenIncome.sum() / womenIncome.size

menIncome = transactions[(transactions.gender == 0) & (transactions.amount > 0)].amount
avgIncomeMen = menIncome.sum() / menIncome.size

abs(avgSpendingWomen - avgSpendingMen), abs(avgIncomeWomen - avgIncomeMen)

(32718.05492022467, 63366.57104801465)

## Задание 6

1. По всем типам транзакций рассчитайте максимальную сумму прихода на карту (из строго положительных сумм по столбцу amount) отдельно для мужчин и женщин (назовите ее "max_income"). Оставьте по 10 транзакций для мужчин и для женщин, наименьших среди всех транзакций по полученным значениям "max_income". 
2. Выделите среди них те, которые встречаются одновременно и у мужчин, и у женщин

In [ ]:
ut = transactions["tr_type"].unique()

max_income = pd.DataFrame([],
                  columns=['Type', 'Men', 'Women'])

# Итерируемся по уникальным типам, делаем выборку, проверяем что сумма
# не отрицательна, добавляем в датафрейм

for value in ut:
  maxMen = transactions[(transactions.tr_type == value) & (transactions.gender == 1)]["amount"].max()
  maxWomen = transactions[(transactions.tr_type == value) & (transactions.gender == 0)]["amount"].max()
  if(maxMen > 0 and maxWomen > 0):
    appendData = pd.DataFrame([[value, maxMen, maxWomen]], 
                             columns=['Type', 'Men', 'Women'])
    max_income = max_income.append(appendData, ignore_index = True)

# 10 по возрастанию у мужчин
setOfMen = max_income.sort_values("Men", ascending=True)[["Type", "Men"]].head(10)

# 10 по возрастанию у женщин
setOfWomen = max_income.sort_values("Women", ascending=True)[["Type", "Women"]].head(10)

# Пересечение (индекс в изначальном датафрейме, тип транзакции)
setOfMen[setOfMen.Type.isin(setOfWomen.Type)].Type

8     4110
2     1010
6     2010
9     2110
12    2370
4     1210
Name: Type, dtype: object

## Задание 7

1. Найдите суммы затрат по каждой категории для мужчин и для женщин. 
2. Найдите топ 5 категорий с самыми большими относительными модулями разности для в тратах для разных полов.

## Задание 8

1. Из поля tr_datetime выделите час tr_hour, в который произошла транзакция, как первые 2 цифры до ":". (\**)
2. Посчитайте ночные поступления для мужчин и женщин. Ночные - это примерно 00-06 часов.